Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.ModelWithNoConditionedSpacesWarn Property
 The model has no conditioned spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ModelWithNoConditionedSpacesWarn { get; }
Public Shared ReadOnly Property ModelWithNoConditionedSpacesWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ModelWithNoConditionedSpacesWarn {
	FailureDefinitionId^ get ();
}
static member ModelWithNoConditionedSpacesWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace